Autodesk.Navisworks.Api.PropertyCategory
A named category of properties

Autodesk.Navisworks.Api.PropertyCategory.CombinedName
Combined name of category

Autodesk.Navisworks.Api.PropertyCategory.DisplayName
Display name of category (localized)

Autodesk.Navisworks.Api.PropertyCategory.Dispose


Autodesk.Navisworks.Api.PropertyCategory.Dispose(System.Boolean)


Autodesk.Navisworks.Api.PropertyCategory.GetBinaryData
Obtain any associated binary data if HasBinaryData is true

Autodesk.Navisworks.Api.PropertyCategory.GetInt64StableId
Returns value of the Int64 stable id contained in this category.
Throws System.InvalidOperationException:
Autodesk.Navisworks.Api.PropertyCategory.HasInt64StableId is false

Autodesk.Navisworks.Api.PropertyCategory.GetStringStableId
Returns value of the String stable id contained in this category.
Throws System.InvalidOperationException:
Autodesk.Navisworks.Api.PropertyCategory.HasStringStableId is false

Autodesk.Navisworks.Api.PropertyCategory.HasBinaryData
Does this category represent binary data?

Autodesk.Navisworks.Api.PropertyCategory.HasInt64StableId
Does this category contain an Int64 stable id ?

Autodesk.Navisworks.Api.PropertyCategory.HasSchemaData
Does this category represent any type of Autodesk.Navisworks.Api.PropertyCategory.SchemaData?

Autodesk.Navisworks.Api.PropertyCategory.HasStableId
Does this category contain any type of stable id ? A stable id can be used to
identify the same Autodesk.Navisworks.Api.ModelItem across multiple versions of a Autodesk.Navisworks.Api.Model.
A category with a stable id contains only a single property with the value of the id.

Autodesk.Navisworks.Api.PropertyCategory.HasStringStableId
Does this category contain a String stable id ?

Autodesk.Navisworks.Api.PropertyCategory.IsDisposed
Has this object been disposed ?

Autodesk.Navisworks.Api.PropertyCategory.IsEditable


Autodesk.Navisworks.Api.PropertyCategory.Name
Name of category (suitable for programmatic use)

Autodesk.Navisworks.Api.PropertyCategory.Properties
The properties in this category

Autodesk.Navisworks.Api.PropertyCategory.SchemaData
Obtain any associated Autodesk.Navisworks.Api.PropertyCategory.SchemaData if HasSchemaData is true

Autodesk.Navisworks.Api.PropertyCategory.ToString
Returns a  that represents the current .
Returns: A  that represents the current .